<?php

return [
    "post" => [
        "validation" => [
            "id" => [
                "integer" => "id поста должен быть числом!"
            ],
            "uid" => [
                "required" => "uid - обязательное поле!",
                "integer" => "uid поста должен быть числом!",
            ],
            "title" => [
                "required" => "Заголовок поста - обязательное поле!",
                "string" => "Заголовок поста должен быть строкой!",
            ],
            "link" => [
                "required" => "Ссылка поста - обязательное поле!",
                "string" => "Ссылка поста должна быть строкой!",
            ],
            "description" => [
                "required" => "Описание поста - обязательное поле!",
                "string" => "Описание поста должно быть строкой!",
            ],
            "author_name" => [
                "required" => "Имя автора - обязательное поле!",
                "string" => "Имя автора должно быть строкой!",
            ],
            "categories" => [
                "array" => "Категории должны быть массивом!",
            ],
            "categories.*.name" => [
                "string" => "Название категории должно быть строкой!",
            ],
        ]
    ]
];
